[
  "My fake plants died because I did not pretend to water them.",
  "I bought a $7 pen because I always lose pens and I got sick of not caring.",
  "I'm sick of following my dreams, I'm going to ask them where they're going and hook up with them later.",
  "The depressing thing about tennis is that no matter how good I get, I'll never be as good as a wall.",
  "I haven't slept for ten days, because that would be too long.",
  "A burrito is a sleeping bag for ground beef.",
  "An escalator can never break: it can only become stairs. You should never see an Escalator Temporarily Out Of Order sign, just Escalator Temporarily Stairs. Sorry for the convenience.",
  "This shirt is 'dry-clean only' — which means it's dirty.",
  "When I was a boy, I laid in my twin-sized bed and wondered where my brother was.",
  "I find a duck's opinion of me is very much influenced by whether or not I have bread.",
  "I wish I could play little league now, I'd be way better than before.",
  "I love my FedEx guy cause he's a drug dealer and he doesn't even know it — and he's always on time.",
  "The last time I called \"shotgun\", we had rented a limo, so I fucked up.",
  "This sign says \"IMPROV,\" but I had a bad set on Friday night, so yesterday they put an \"E\" on the end of it.",
  "I don't have a microwave oven, but I do have a clock that occasionally cooks stuff.",
  "I'm against picketing, but I don't know how to show it.",
  "I got my hair highlighted, because I felt some strands were more important than others.",
  "I was at this casino minding my own business, and this guy came up to me and said, \"You're gonna have to move, you're blocking a fire exit.\" As though if there was a fire, I wasn't gonna run. If you're flammable and have legs, you are never blocking a fire exit.",
  "People tell me how hard it is to stop smoking; I think it's about as hard as it is to start flossing.",
  "Stephen Lynch is funny, he's a hard act to follow. I'm a hard act to follow too, cause when I'm done I take the microphone with me.",
  "You don't have to be sweaty and holding a basketball to enjoy a Gatorade; you could just be a thirsty dude — Gatorade forgets about this demographic!",
  "I'd hate to be a giraffe with a sore throat.",
  "I put fruit on top of my waffles, because I want something to brush off.",
  "I was gonna have my teeth whitened, but then I said fuck that, I'll just get a tan instead.",
  "When I was on acid I would see things like beams of light, and I would hear things that sounded an awful lot like car horns.",
  "Is a hippopotamus a hippopotamus? Or just a really cool opotamus?",
  "I went to a record store, they said they specialized in hard-to-find records — nothing was alphabetized.",
  "A severed foot is the ultimate stocking stuffer.",
  "What happened when Jesus wanted to swim?",
  "Onions make me sad. A lot of people don't realize that.",
  "If my kid couldn'tt draw I'd make sure that my kitchen magnets didn't work.",
  "When someone hands you a flyer, it's like they're saying \"Here, you throw this away.\"",
  "A dog is forever in the push-up position.",
  "I got a parrot and it talked, but it did not say \"I'm hungry\", so it died.",
  "I'm sick of following my dreams, I'm going to ask them where they're going and hook up with them later.",
  "I turned to my friend and said \"How do you abbreviate Arkansas\". He said \"I don't know, just start spelling it, and then quit.\"",
  "I like to play blackjack. I'm not addicted to gambling, I'm addicted to sitting in a semi-circle.",
  "I once saw a forklift lift a crate of forks. And it was way too literal for me.",
  "I order the club sandwich all the time and I'm not even a member. I don't know how I get away with it.",
  "My belt holds my pants up, but the belt loops hold my belt up; so which one's the real hero?",
  "At the end of my letters, I like to write \"P.S.\"– this is what part of the alphabet would look like if Q and R were eliminated.'",
  "If Spiderman was real, and I was a criminal, and he shot me with his web, I would say, \"Dude, thanks for the hammock.\"",
  "Swiss Cheese is a rip-off — it's the only cheese I can bite into and miss.",
  "It's very dangerous to wave to people you don't know because what if they don't have hands? They'll think you're cocky.",
  "If carrots got you drunk, rabbits would be messed-up.",
  "I wanted to buy a candle holder, but the store didn't have one. So I got a cake.",
  "I got an ant farm... Them fellas didn't grow shit!",
  "I went to a doctor, all he did was suck blood from my neck. Don't go see Dr. Acula.",
  "I had a Mr. Pibb, Mr. Pibb is a replica of Dr. Pepper... But it's the bullshit replica, cause dude didn't even get his degree.",
  "One time a guy handed me a picture and said \"Here's a picture of me when I was younger.\" Every picture is of you when you were younger! \"Here's a picture of me when I'm older.\" You son of a bitch, how'd you pull that off? Let me see that camera.",
  "I'd like to see a forklift lift a crate of forks... It'd be so damn literal! You are using that machine to its exact purpose!",
  "Last week I helped my friend stay put. It's a lot easier than helping someone move. I just went over to his house and made sure that he did not start to load shit into a truck.",
  "I think we should only get 3 honks a month on the car horn, because people honk the car horn too much. 3 honks, that's the limit. And then someone cuts you off, ffffft, you press your horn, nothing happens. You're like, \"shit! I wish I wouldn't have seen Ricky on the sidewalk!\"",
  "I'm against picketing, but I don't know how to show it.",
  "I wanna be a race car passenger - just a guy who bugs the driver. \"Say man, can I turn on the radio? You should slow down. Why we gotta keep going in circles? Can I put my feet out the window? Man, you really like Tide.\"",
  "My friend asked me if I wanted a frozen banana, I said \"no, but I want a regular banana later, so... Yeah.\"",
  "I walked by a dry cleaner at 3am, the sign said \"Sorry, we're closed.\" You don't have to be sorry, it's 3am and you're a dry cleaner. It would be ridiculous for me to expect you to be open. I'm not gonna walk in at 10am and say \"Hey, I walked in at 3am and you guys were closed. Somebody owes me an apology.\"",
  "I got a business card, cause I wanna win some lunches. That's what my business card says: \"Mitch Hedberg, Potential Lunch Winner.\"",
  "I had a paper route when I was a kid, I was a paper boy. I was supposed to go to 2,000 houses... Or 2 dumpsters!",
  "I like the hot tubs at the hotels. I like to go there when there's a guy in there already, I say \"hey man, you mind if I join you?\" He says no. Then I go and I turn the whirlpool heat up, then I go by and I add some carrots and onions. Then I say \"hey man, just simmer for a while - I mean, sit there.\"",
  "This product that was on TV was available for four easy payments of $19.95. I would like a product that was available for three easy payments and one complicated payment. We can't tell you which payment it is, but one of these payments is going to be hard. The mailman will get shot, the envelope will not seal, the stamp will be in the wrong denomination. The final payment must be made in wampum.",
  "I saw this wino, he was eating grapes. It's like, \"dude, you have to wait.\"",
  "I saw a commercial that said, \"forget everything you know about slip covers!\" So I did. And it was a load off my mind. Then the commercial tried to sell me slip covers, but I didn't know what the hell they were.",
  "Every McDonald's commercial ends the same way, right? \"Prices and participation may vary.\" I wanna open a McDonald's and not participate in anything. I wanna be a stubborn McDonald's owner. Cheeseburgers? Nope. We got spaghetti! And blankets!",
  "I had a job interview at an insurance company once, and the lady said \"Where do you see yourself in five years?\" I said, \"Celebrating the fifth year anniversary of you asking me this question!\"",
  "I bought a house, it's a 2-bedroom house. But I think it's up to me how many bedrooms there are, don't you? Fuck you real estate lady, this bedroom has an oven in it! This bedroom has a lot of people sitting around watching TV. This bedroom's over in that guy's house.",
  "I wanna hang a map of the world in my house. Then I'm gonna put pins into all the locations that I've traveled to. But first, I'm gonna have to travel to the top two corners of the map, so it won't fall down.",
  "You know when a company wants to use letters in their phone number to be catchy? But often times they use too many letters. \"Give us a call down here at 1-800-I-Really-Enjoy-Carpeting.\" It's too many letters, man. \"Hello?\" \"Hold on, I'm only on 'Enjoy'! How did you know I was calling?\"",
  "I would imagine if you understood Morse code, a tap dancer would drive you crazy!",
  "I had a small scene in a movie with Peter Frampton. And we had to smoke pot for our scene - but it was fake pot! Do not buy pot on a movie set. But I got to smoke fake pot with Peter Frampton, that's a cool story. It's as cool as smoking real pot with a guy who looks like Peter Frampton... I've done that way more.",
  "The thing that's depressing about tennis is, no matter how good I get, I'll never be as good as a wall. I played a wall once... They're fucking relentless!",
  "People ask me what words mean... They say, \"what does 'composition' mean?\" Some people would say, \"put it in a sentence.\" But I need a little more. \"Put it in a play.\"",
  "If I'm out to dinner with a group of friends, and someone offers to pay for the check, I immediately reach for my wallet. Because inside is a note that says \"say thanks.\"",
  "Every book is a children's book, if the kid can read!",
  "My friend said to me \"I think the weather's trippy.\" And I said \"No man, it's not the weather that's trippy. Perhaps it is the way that we perceive it that is indeed trippy.\" Then I thought \"man, I should have just said 'yeah'.\"",
  "I like escalators, because an escalator can never break; it can only become stairs. You would never see an \"escalator temporarily out of order\" sign, just \"Escalator temporarily stairs... Sorry for the convenience. We apologize for the fact that you can still get up there.\"",
  "I was in a hotel room and my friend comes over, he says \"can I use the phone?\" I said \"certainly.\" He said \"do I need to dial 9?\" \"Yeah... Especially if it's in the number. You can try 4 and 5 back to back real quick.\"",
  "I wanna get a job naming kitchen appliances, that seems easy. Refrigerator, toaster, blender... You just say what the thing does, then you add \"er\". Kitchen Appliance Naming Institute... \"What does this thing do?\" \"It keeps shit fresh.\" \"Well then that's a fresher! I'm going on break.\"",
  "I did a radio interview with XM radio... They said \"you can swear on XM radio.\" No shit, cause nobody can hear it. You can swear in the woods, too!",
  "As a comedian, you have to start the show strong and you have to end the show strong. Those are the two key elements. You can't be like pancakes... All exciting at first, but then by the end you're fuckin' sick of em.",
  "Alcoholism is a disease, but it's the only disease that you can get yelled at for having. Goddammit Otto, you're an alcoholic! Goddammit Otto, you have lupus! One of those two doesn't sound right.",
  "I know a lot about cars, I can look at a car's headlights and tell you exactly which way it's coming.",
  "I say the word \"totally\" way too much. I need to change it and use a word that's different but means the same. \"Mitch, do you like submarine sandwiches?\" \"All-encompassingly!\"",
  "I went to the Home Depot the other day, which was unnecessary... I need to go to the Apartment Depot, which is just a big warehouse with people standing around saying \"hey, we ain't gotta fix shit!\"",
  "I like refried beans, that's why I wanna try fried beans. Cause maybe they're just as good, and we're wasting time. You don't have to fry them again, after all!",
  "I hate dreaming, because when you wanna sleep, you wanna sleep. Dreaming is work, you know? Like there I am, laying in my comfortable bed in my hotel room... Next thing I know, I have to build a go-cart with my ex-landlord.",
  "I drank some boiling water, because I wanted to whistle.",
  "On a traffic light, \"green\" means \"go\" and \"yellow\" means \"yield\", but on a banana, it's just the opposite. \"Green\" means \"hold on\". \"Yellow\" means \"go ahead\". And \"red\" means, \"where the fuck did you get that banana at?\"",
  "My apartment is infested with koala bears... It's the cutest infestation ever! Way better than cockroaches. When I turn on the light, a bunch of koala bears scatter. And I don't want 'em to, you know?",
  "I don't have any children, but if I had a baby, I would have to name it. So I would buy a baby naming book... Or I would invite somebody over who had a cast on!",
  "I think Bigfoot is blurry, that's the problem. It's not the photographers' fault! Bigfoot is blurry... And that's extra scary to me. Cause there's a large, out-of-focus monster roaming the countryside.",
  "I opened up a yogurt, and underneath the lid it said \"please try again\", because they were having a contest I was unaware of. But I thought I might have opened the yogurt wrong. Or maybe Yoplait was trying to inspire me. \"Come on Mitchell, don't give up... Please try again.\" A message of inspiration from your friends at Yoplait. Fruit on the bottom, hope on top.",
  "I miss the $2... I could break a $2.",
  "My sister wanted to be an actress... She never made it, but she does live in a trailer. She got half-way. It's like she's an actress, she's just never called to the set.",
  "Sometimes I wave to people I don't know... Very dangerous to wave to someone you don't know, because what if they don't have a hand? They'll think you're cocky! Look what I got, motherfucker... This thing is useful! I'm gonna go pick something up!",
  "I did a radio interview, the DJ's first question was \"who are you?\" I had to think: is this guy really deep, or did I drive to the wrong station?",
  "I think Pizza Hut is the cockiest pizza chain on the planet, because Pizza Hut will accept all competitors' coupons. That makes me wish I had my own pizza place. \"Mitch's Pizzaria... This week's coupon: unlimited free pizza. Special Note: coupon not good at any of the Mitch's Pizza locations. Free pizza oven with purchase of a small Coke. Two-for Tuesday: buy one pizza, get one franchise free.\"",
  "Last time I called shotgun, we had rented a limo... So I fucked up.",
  "Foosball fucked up my perception of soccer. I thought you had to kick the ball, and then spin around and round. I can't do a backflip, much less several... Simultaneously with two other guys... That look just like me.",
  "I had a bag of Fritos, they were Texas Grilled Fritos. These Fritos had grill marks on 'em. Hell yeah! Reminds me of summer, when we used to fire up the barbecue, and throw down on some Fritos. I can still see my dad with the apron on... \"you better flip that Frito dad, you know how I like it.\"",
  "You know, I'm sick of following my dreams, man. I'm just gonna ask where they're going, and hook up with them later.",
  "Fish are always eating other fish. If fish could scream, the ocean would be loud as shit! You would not want to submerge your head... Nothing but fish going \"Ahhhh, fuck! I thought I looked like that rock!\"",
  "The club owner here hooks me up with drugs, like cocaine or pot brownies. But last time I was in town he gave me a drug for attention deficit disorder, because he's afflicted. But I'm not, so what happened to me was I suddenly had an extra-long attention span. People would be telling me a story, then the story would end and I'd get all mad and shit. \"Come on man, there's gotta be more to that story!\"",
  "I wake up in the morning, I make myself a bowl of instant oatmeal, then I don't do shit for an hour. Which makes me wonder why I need the instant oatmeal! I could get the regular oatmeal and feel productive.",
  "I got into an argument with a girlfriend inside of a tent. That's a bad place for an argument. Cause then I tried to walk out, and slam the flap. How are you supposed to express your anger in this situation? Zip it up really quick?",
  "I mumble a lot off stage, I'm a mumbler. If I'm walking with a friend, and I say something, he won't hear me, he'll say \"what?\" So I'll say it again, but once again he doesn't hear me, so he says \"what?\" But really it's just some insignificant shit that I'm saying... But now I'm yelling, \"That tree is far away!\"",
  "I did comedy for a fundraiser once, we were trying to raise money to buy one of those machines that shows how much money has been raised.",
  "I've had the AIDS test four times. And that shit is scary, doesn't matter what you've been doing. So I don't get the regular AIDS test anymore, I get the _roundabout_ AIDS test. I call up my friend Brian and say \"Brian, do you know anyone that has AIDS? No? Cool... Cause you know me.\"",
  "I get the Reese's candy bar... If you read that name, Reese's, that's an \"apostrophe s\" on the end of that name. That means the candy bar is his. I didn't know that. Next time you're eating a Reese's candy bar and a guy named Reese comes buy and says \"let me have that\", you better hand it over. \"I'm sorry Reese, I didn't think I'd ever run into you. You're a fuckin' bully, man!\"",
  "The Kit-Kat candy bar has the name \"Kit-Kat\" imprinted into the chocolate. That robs you of chocolate! That's a clever chocolate-saving technique. I'll go down to the factory... \"you owe me some letters!\"",
  "As a comedian, I always get into situations where I'm auditioning for movies and sitcoms, you know? As a comedian, they want you to do other things besides comedy. They say \"alright you're a comedian, can you write? Write us a script. Act in this sitcom.\" They want me to do shit that's related to comedy, but it's not comedy, man. It's not fair, you know? It's as though if I was a cook, and I worked my ass off to become a really good cook, and they said \"alright you're a cook... Can you farm?\"",
  "This one guy said \"look at that girl's butt! She has a nice butt.\" I said \"yeah, I bet she can sit down excellently.\"",
  "2 in 1 shampoo... 2 in 1 is a bullshit term, because 1 is not big enough to hold 2. That's why 2 was created. If it was 2 in 1, it would be overflowing... The bottle would be all sticky and shit.",
  "I bought a doughnut, and they gave me a receipt for the doughnut. I don't need a receipt for the doughnut, man, I'll just give you the money then you give me the doughnut! End of transaction. We don't need to bring ink and paper into this. I just can't imagine a scenario where I would have to prove that I bought a doughnut. Some skeptical friend... Don't even act like I didn't get that doughnut! I got the documentation right here. Oh wait, it's at home... In the file... Under 'D', for \"doughnut\".",
  "I called the hotel operator, she said \"how can I direct your call?\" Well, you could say \"action!\" And I will begin to dial. And then when I say goodbye, you could yell \"cut!\"",
  "When we were on acid, we would go into the woods... Cause when you're in the woods tripping, there's less likely a chance you'll run into an authority figure. But we ran into a bear. That was even more of a buzzkill. My friend Dwayne was standing there raising his right hand, swearing to help prevent forest fires. We got away from the bear, he put his arm around my shoulder, he said \"Mitchell... Smokey is way more intense in person!\"",
  "I had the cab driver drive me here backwards... The fucker owed me $27.50!",
  "I bought a scratch-off ticket, but then I accidentally spilled some cortisone cream on it, so it did not need to be scratched.",
  "I played in a death metal band. People either loved us or they hated us... Or they thought we were okay. A lot of death metal bands have intense names, like \"Rigor Mortis\" or \"Mortuary\" or \"Obituary\". We weren't that intense, we just went with \"Injured\". Later on we changed it to \"A Capella\"... As we were walking out of the pawn shop.",
  "I was in downtown Boise Idaho and I saw a duck. And I knew the duck was lost, cause ducks ain't supposed to be downtown, there's nothing for 'em there. So I went to a Subway sandwich shop, I said \"let me have a bun.\" But she wouldn't sell me just the bun, she said I had to have something on it. She told me it's against regulations for Subway to sell just the bun. I guess the two halves ain't supposed to touch. So I said alright, well put some lettuce on it. They said, \"that'll be $1.75.\" I said \"it's for a duck.\" They said \"alright, well then it's free.\" See, I did not know that. Ducks eat for free at Subway!! Had I known that, I would have ordered a much larger sandwich. \"Let me have the steak fajita sub. But don't bother ringing it up... It's for a duck! There are 6 ducks out there, and they all want Sun Chips!!\"",
  "I flew over an island that said \"S.O.S.\", so I landed, because I wanted to clean their pans.",
  "You know when they show someone on TV, washing their hair under a waterfall? That's fucking bullshit man... Cause that thing would knock you on your ass!",
  "I saw a billboard for a lottery, it said \"estimated lotto jackpot 55 million.\" See, I did not know that shit was estimated. That would suck if you won and they go, \"oh, we were off by two zeros. We estimate that you are angry!\"",
  "My girlfriend works at Hooters... In the kitchen.",
  "I hope the next time I move I get a real easy phone number. Something like 222-2222. I would say sweet. People would say \"Mitch, how do I get a hold of you?\" I would say, \"Just press 2 for a while! And when I answer, you will know that you have pressed 2 enough.\"",
  "I'm so glad I'm almost done the set, man... Because I have a roll of Lifesavers in my pocket, and pineapple is next!",
  "When you go to a restaurant on the weekends, it's busy, so they start a waiting list. They start calling out names, they say \"Dufrene, party of 2. Table ready for Dufrene, party of 2.\" And if no one answers, they'll say their name again. \"Dufrane, party of 2.\" But then if no one answers they'll just go right on to the next name. \"Bush, party of 3.\" Yeah... What happened to the Dufrenes? No one seems to give a shit. Who can eat at a time like this? People are missing! You fuckers are selfish. The Dufrenes are in someone's trunk right now, with duct tape over their mouths. And they're hungry - that's a double whammy. We need help. Bush, SEARCH party of 3! You can eat once you find the Dufrenes.",
  "My manager was concerned, he said \"Mitch, don't use liquor as a crutch.\" I can't use liquor as a crutch... Because a crutch _helps_ me walk. Liquor severely screws up the way I walk. It ain't like a crutch, it's like a step I didn't see.",
  "I used to live here in Los Angeles... And I had an apartment, and I had a neighbor. And whenever he would knock on my wall, I knew he wanted me to turn my music down. And that made me angry, cause I like loud music. So when he knocked on the wall, I'd mess with his head. I'd say, \"go around! I cannot open the wall. I don't know if you have a doorknob on the other side, but over here there's nothing... It's just flat!\"",
  "I smoke cigars occasionally, I don't know a lot about cigars. Like I'm at the cigar store, the man behind the counter says \"What kind of cigars do you like?\" \"Uhh... Itsaboy's.\"",
  "I used to have really long hair, and people thought I was high on stage, because people associate long hair with drug use. I wish long hair was associated with something other than drug use, like an extreme longing for cake. And then strangers would see a long-haired guy, they'd say \"that fucker eats cake! He is on Bundt cake!\" Mothers saying to their daughters, \"don't bring the cake-eater over here anymore, he smells like flour. Did you see how excited he got when he found out your birthday was fast approaching?\"",
  "I had a roommate, his name was Eddie, and Eddie was slow on the mental draw. I was writing a letter, I had a problem... I said, \"Ed, how do you abbreviate Arkansas?\" He said, \"I don't know, just start spelling it, then quit!\"",
  "Like, we had a refrigerator with a hard-boiled egg inside, after a few days the shell started to crack. Eddie's first comment was \"man, this guy's a survivor!\"",
  "You know when you go to concerts, and the kids get on stage and they jump into the crowd, stage diving? People think that's dangerous, but not me. Because humans are made out of 95% water! So the audience is 5 percent away from a pool.",
  "I rent a lot of cars, cause I go on the road. And when I drive a rental car, I don't know what's going on with it, right? So a lot of times I'll drive for like 10 miles with the emergency brake on. That doesn't say a lot for me, but it really doesn't say a lot for the _emergency brake_.",
  "I play the guitar, I taught myself how to play the guitar, which was a bad decision... Because I didn't know how to play it, so I was a shitty teacher. I would never have went to me.",
  "I hate turkeys. If you go to the grocery store and you stand in front of the lunch meat section for too long, you start to get pissed off at turkeys. You see, like, turkey ham, turkey pastrami, turkey bologna... Somebody needs to tell the turkeys, \"Man, just be yourself!\"",
  "Rice is great if you're really hungry and want to eat two thousand of something.",
  "I don't have a girlfriend. But I do know a woman who'd be mad at me for saying that.",
  "Wearing a turtleneck is like being strangled by a really weak guy, all day. Wearing a backpack and a turtleneck is like a weak midget trying to bring you down.",
  "You know when they have a fishing show on TV? They catch the fish and then let it go. They don't want to eat the fish, they just want to make it late for something.",
  "A waffle is like a pancake with a syrup trap.",
  "I'm a heroine addict. I need to have sex with women who have saved someone's life.",
  "I wish my name was Brian because maybe sometimes people would misspell my name and call me Brain. That's like a free compliment and you don't even gotta be smart to notice it.",
  "Y'know, you can't please all the people all the time... And last night, all those people were at my show.",
  "I want to get a vending machine, with fun sized candy bars, and the glass in front is a magnifying glass. You'll be mad, but it will be too late.",
  "I like Kit-Kat, unless I'm with four or more people.",
  "I saw a human pyramid once. It was very unnecessary.",
  "I wear a necklace, cause I wanna know when I'm upside down.",
  "I had a stick of CareFree gum, but it didn't work. I felt pretty good while I was blowing that bubble, but as soon as the gum lost its flavor, I was back to pondering my mortality.",
  "I'm gonna fix that last joke by taking out all the words and adding new ones.",
  "It's weird... People say they're not like apes. Now how do you explain football then?",
  "Dogs are forever in the push up postion.",
  "If I had nine of my fingers missing I wouldn't type any slower.",
  "Bologna is a deli meat for people with eyes.",
  "Fettucini alfredo is macaroni and cheese for adults.",
  "I'd like to get four people who do cart wheels very good, and make a cart.",
  "I like to hold the microphone cord like this, I pinch it together, then I let it go, then you hear a whole bunch of jokes at once.",
  "Spaghetti... I can't eat spaghetti, there's too many of them. No matter how hungry I am, 1,000 of something is too many. I'll have 1,000 pieces of noodles.",
  "I remixed a remix, it was back to normal.",
  "I think foosball is a combination of soccer and shish kabobs.",
  "Every time I go and shave, I assume there's someone else on the planet shaving. So I say, \"I'm gonna go shave, too.\"",
  "I used to be a hot-tar roofer. Yeah, I remember that... Day.",
  "People teach their dogs to sit; it's a trick. I've been sitting my whole life, and a dog has never looked at me as though he thought I was tricky.",
  "I recently took up ice sculpting. Last night I made an ice cube. This morning I made 12, I was prolific.",
  "All these jokes have been pre-approved as funny by me.",
  "Do you think I am standing here, making this up as I go? I am sorry to disillusion you. I am not Robin Williams. I am the king of the pen.",
  "Why is Cloud 9 so amazing? What is wrong with Cloud 8? That joke came off the top of my head, and the top of my head ain't funny!",
  "I can whistle with my fingers, especially if I have a whistle.",
  "My hotel doesn't have a 13th Floor because of superstition, but c'mon man... People on the 14th floor, you know what floor you're really on.\n– \"What room are you in?\"\n– \"1401\".\n– \"No, you're not. Jump out of window, you'll die earlier!\"",
  "When you go to a bar that has a black light, everybody looks cool. Except for me, because I was under the impression that the mustard stain came out.",
  "That would be cool if you could eat a good food with a bad food and the good food would cover for the bad food when it got to your stomach. Like you could eat a carrot with an onion ring and they would travel down to your stomach, then they would get there, and the carrot would say, It's cool, he's with me.",
  "When you put Listerine in your mouth, it hurts. Germs do not go quietly.",
  "Imagine if you were a drummer, and you accidentally picked up two magic wands instead of sticks. There you are, keeping the beat, the next thing you know, your bass player turns into a can of soup.",
  "I know people who believe in ghosts but don't believe in themselves.",
  "Sometimes I get really lonely. Especially when I'm throwing a Frisbee.",
  "If you're watching a parade, don't follow it. It never changes. If the parade is boring, run in the opposite direction. You will fast-forward the parade.",
  "I don't wear a watch because I want my arms to weigh the same.",
  "If you can't sleep, count sheep. Don't count endangered animals. You will run out.",
  "If 13 is unlucky, then 12 and 14 are guilty by association.",
  "Pepperidge Farm bread. That's fancy bread. You can tell it's fancy because it's wrapped twice. You open it, and it still isn't open. That's why I don't buy it. I don't need another step between me and toast.",
  "Once I saw a duck walking down the street so I went into Subway and ordered two pieces of bread, and they informed me that they could not do that, like there was some special rule at Subway that two pieces of bread weren't allowed to touch. So the woman asked me what I wanted on the sandwich and I said I do not care, it is for a duck, and she was like oh then it's free. I was not aware that ducks eat for free at Subway. It's like give me a chicken fajita sub, but don't worry about ringing it up, it is for a duck.",
  "I tried to throw a yo-yo away. It was impossible.",
  "You should never tell someone they have a nice dimple, because maybe they were shot in the face with a BB gun.",
  "I can read minds, but I'm illiterate.",
  "Magicians disappear all the time, but as soon as a regular person does it, everyone is all scared.\n– \"Tom's gone!\"\n– \"Is he a magician?\"\n– \"No.\"\n– \"Then let's print up some flyers!\"",
  "When it comes to racism, you hear people say, \"I don't care if people are white, black, purple or green.\" Hold on, now, purple or green? Come on now, you gotta draw the line somewhere.",
  "I was walking down the street with my friend and he said \"I hear music,\" as though there's any other way to take it in. \"You're not special. That's how I receive it too... I tried to taste it, but it did not work.\"",
  "When you open the elevator on the top floor of a building and the other guy doesn't get out, something is seriously wrong.",
  "I think animal crackers make people think that all animals taste the same.",
  "Here's a thought for sweat shop owners: Air Conditioning. Problem solved.",
  "I was at a restaurant, and I ordered a chicken sandwich, but I don't think the waitress understood me. She asked me, \"How would you like your eggs?\"\nI thought I would answer her anyway and said, \"Incubated! And then raised, plucked, beheaded, cut up, put onto a grill, and then put onto a bun. Damn! I don't have that much time! Scrambled!\"",
  "As an adult, I'm not supposed to go down slides. So if I'm at the top of a slide, I have to pretend that I got there accidentally – \"How the hell did I get up here? I guess I have to slide down. Whee!\"\nThat's what you say when you're having fun. You refer to yourself and some other people.",
  "Chicago is known as the \"Windy City\", and Montana is called \"The Big Sky State\", so I think that we should somehow combine the two to create the ultimate kite-flying experience.",
  "I was in a convenience store, reading a magazine. The clerk told me, \"This is not a library!\" \"OK! I will talk louder, then!\"",
  "I was on a bus once, it was in the middle of the night, and I had a box of crackers and a can of Easy Cheese. It was dark, and it was a surprise how much cheese I had applied on each cracker. That's why they should have a glow-in-the-dark version of Easy Cheese. It's not like the product has any integrity to begin with. If you buy a room-temperature cheese that you squeeze out of a can, you probably won't get mad because it glows in the dark too.",
  "Why are there no \"during\" pictures?",
  "I went to the airport, I put my bag in the x-ray machine, I found out my bag has cancer. It only has six more months to hold stuff.",
  "I am wearing a vest. If I had no arms, it would be a jacket.",
  "I thought my teeth were white until I washed my face with Noxzema. My teeth are off-white. I'm not even white. I'm off-white. It's a new race; we will prevail!",
  "One time I stayed at a haunted motel. When I checked into my room, there was a sheet on the floor, and I thought it was a ghost that had passed out, so I kicked it.",
  "I got binoculars 'cause I don't want to go that close.",
  "I went to a restaurant, and I saw a guy wearing a leather jacket, eating a hamburger, drinking a glass of milk. I said, \"Dude, you are a cow. The metamorphosis is complete. Don't fall asleep or I will tip you over!\"",
  "How does a sesame seed stick to a bun? That's magical. There must be some sesame seed glue out there. Either that or they're adhesive on one side. Peel off the backing, place it on the bun.",
  "I don't own a cell phone or a pager. I just hang around everyone I know, all the time. If someone wants to get a hold of me, they just say 'Mitch,' and I say 'what?' and turn my head slightly.",
  "My girlfriend is named Lynn. She spells her name \"Lynn\". My old girlfriend's name is Lyn, too, but she spells it \"Lyn\". Every now and then I screw up, I call my new girlfriend by my old girlfriend's name, and she can tell because I don't say \"n\" as long.",
  "When I get a cold sore, I put Carmex on it, because Carmex is supposed to alleviate cold sores. I don't know if it does help, but it will make them more shiny and noticeable. It's like cold-sore-highlighter. Maybe they could come up with an arrow that heals cold sores.",
  "I saw soda pop for $1.20 a six pack. That price messes with your head. You start thinking you're gonna sell soda pop. Suddenly I've got packs of pop with me. \"Looking to buy some pop? 50 cents a can. It's not refrigerated because this is a half-assed commitment!\"",
  "I think Pringles initial intention was to make tennis balls. But on the day that the rubber was supposed to show up, a big truckload of potatoes arrived. But Pringles is a laid back company. They said, \"Screw it. Cut 'em up!\"",
  "I type a 101 words a minute. But it's in my own language.",
  "I tried to walk into Target, but I missed. I think the entrance to Target should have people splattered all around.",
  "I like cottage cheese. That's why I want to try other dwelling cheeses, too. How about studio apartment cheese? Tent cheese? Mobile home cheese? Do not eat mobile home cheese in a tornado.",
  "If you're a fish and you want to be a fish-stick, you have to have very good posture.",
  "I played golf... I did not get a hole in one, but I did hit a guy. That's way more satisfying.",
  "I've never been to a hotel with a rotating restaurant on top, but one time I took my girlfriend to a merry-go-round, and I gave her a burrito.",
  "I like baked potatoes. I don't have a microwave oven, and it takes forever to bake a potato in a conventional oven. Sometimes I'll just throw one in there, even if I don't want one, because by the time it's done, who knows?",
  "You know when you see an advertisement for a casino, and they have a picture of a guy winning money? That's false advertising, because that happens the least. That's like if you're advertising a hamburger, they could show a guy choking. \"This is what happened once.\"",
  "They say the recipe for Sprite is lemon and lime. I tried to make it at home. There's more to it than that.",
  "A minibar is a machine that makes everything expensive. When I take something out of the minibar, I always fathom that I'll go and replace it before they check it off, but they make that stuff impossible to replace. I go to the store and ask, 'Do you have coke in a glass harmonica... Do you have individually wrapped cashews'",
  "I went to a heavy metal concert. The singer yelled out, \"How many of you people feel like human beings tonight?\" And then he said, \"How many of you feel like animals?\" The thing is, everyone cheered after the animals part, but I cheered after the human beings part because I did not know there was a second part to the question.",
  "I have an oscillating fan at my house. It goes back and forth. It looks like the fan is saying \"No.\" So I like to ask it questions that a fan would say \"No\" to! Do you keep my hair in place? Do you keep my documents in order? Do you have 3 settings? LIAR! My fan lied to me. Now I will pull the pin up. Now you're not saying ANYTHING!",
  "I got some tartar-control toothpaste a while back. I've still got tartar, but it's under control.",
  "I got a king-sized bed. I don't know any kings, but if one came over, I guess he'd be comfortable.",
  "A fly was very close to being called a land, because that's what it does half the time.",
  "I met this girl, she was an actress, and she gave me her number. It started with 555.",
  "I like those blow-up beds. \"This becomes a full size bed in three minutes!\" Well, a mattress kicks your ass. Zero seconds. \"Yeah, but you can store this thing.\" You can store a bed, too – in the bedroom.",
  "I would imagine the inside of a bottle of cleaning fluid is really clean. I would imagine a vodka bottle is really drunk.",
  "I never joined the army because \"at ease\" was never that easy to me. Seemed rather uptight still. I don't relax by parting my legs slightly and putting my hands behind my back. That does not equal ease. At ease was not being in the military. I am at ease, bro, because I am not in the military.",
  "I want to ride in a cold air balloon. \"This isn't going anywhere!\"",
  "I went to the store and bought eight apples; the clerk said, \"Do you want these in a bag?\" I said, \"Oh, no, man, I juggle.\"",
  "Swiss cheese is the only cheese you can draw and people can identify. You can draw American cheese, but someone will think it's cheddar. It's the only cheese you can bite and miss. \"Hey Mitch - does that sandwich have cheese on it?\" \"Every now and then!\"",
  "Kittens play with yarn, they bat it around. What they're really doing is saying, \"I can't knit, get this away from me!\"",
  "I was going to stay overnight at my friend's house - he said, \"you'll have to sleep on the floor.\" Damn gravity! You don't know how bad I wanted to sleep on the wall.",
  "Advil has a candy coating. It's delicious. Then it says on the bottle, do not have more than two. Then why do they have a candy coating? I cannot help myself. Let me have ten Advil, I have a sweet tooth.",
  "I want to get non-aerosol mace, you just rub it in. \"Dude who is attacking me - come a little closer!\"",
  "I went to the park and saw this kid flying a kite. The kid was really excited. I don't know why, that's what they're supposed to do. Now if he had had a chair on the other end of that string, I would have been impressed.",
  "Xylophone is spelled with an X. That's wrong. It should be a Z up front. Next time you spell xylophone, use a Z. If someone says, \"That's wrong!\", you say, \"No, it ain't.\" If you think that's wrong, then you need to have your head Z-rayed.",
  "If a drink was ice cold, it would be impossible to drink. Because it would be solid. Here's a drink, Mitch - it's ice cold. I guess I could lick it.",
  "I ate one anchovy, and that is why I did not eat two anchovies.",
  "I like vending machines, because snacks are better when they fall. If I buy a candy bar at the store, oftentimes I will drop it so that is achieves its maximum flavor potential.",
  "I wish they made fajita cologne, because that stuff smells good. \"What's that you're wearing? That's sizzlin'!\"",
  "I went to England to tell jokes, and I wanted to tell my _Smokey the Bear joke_, but I had to ask the English people if they knew who _Smokey the Bear_ is. But they don't. In England, Smokey the Bear is not the forest-fire-prevention representative. They have _Smackie the Frog_. It's a lot like a bear, but it's a frog. And that's a better system, I think we should adopt it. Because bears can be mean, but frogs are always cool. Never has there been a frog hopping toward me and I thought, \"Man, I better play dead!\"",
  "If you don't know a light bulb is a three-way light bulb, it messes with your head. You reach to turn it off, and it just gets brighter! That's the exact opposite of what I wanted you to do! So you turn the switch again, and it gets brighter once more! I will break you, light bulb!",
  "If you find yourself lost in the woods, build a house. \"Well, I was lost, but now I live here!\"",
  "I'm into carpooling, because sometimes my car gets hot and needs to refresh itself.",
  "I thought I'd go to a craft fair, and there would be a jar of jellybeans there - \"Guess how many jellybeans are in this jar, and win a prize\". Aw, come on, man, let just me have some. I'll tell you what, guess how many jellybeans I want! If you guessed a handful, you are right.",
  "If I had a dollar for every time I said that, I'd be making money in a very weird way.",
  "I have a cheese-shredder at home, which is its positive name. They don't call it by its negative name, which is _sponge-ruiner_. Because I wanted to clean it, but now I have little bits of sponge that would melt easily over tortilla chips.",
  "I hate sandwiches at New York delis. Too much meat on the sandwich. It's like a cow with a cracker on either side.\n– \"Would you like anything else with the pastrami sandwich?\"\n– \"Yeah, a loaf of bread and some other people!\"",
  "People ask me for my autograph after a show. I'm not famous, I think they're messing with me. I think they're trying to make me late for something.",
  "I used to drink wine. This girl asked me:\n– \"Doesn't wine give you a headache?\"\n– \"Yeah, eventually, but the first and the middle part are amazing!\"",
  "I like cinnamon rolls, but I don't always have time to make a pan. That's why I wish they would sell cinnamon roll incense. After all I'd rather light a stick and have my roommate wake up with false hopes.",
  "I was at a bar, and this guy bumped into me, and he did not apologize, and he said, \"Move!\" I thought that was rude, so I said, \"Go to hell!\" Then I started to run. He caught up to me. He had a mustache, a goatee, a pair of earrings, sunglasses, a ponytail and he was wearing a hat. He said, \"Hey, you got a lot of nerve!\" I said, \"Hey, you got a lot of... Cranium accessories!\""
]
